---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalCurveType
source: html/2c102724-4c8b-e648-31da-31fb383801fb.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalCurveType

Identifies what type of Analytical Model curves should be extracted.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum AnalyticalCurveType
```